nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512] 
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.50, 512] 

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, MBR_HGBlock, [48, 128, 3]]  # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, MBR_HGBlock, [96, 512, 3]]   # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P4/16
  - [-1, 6, MBR_HGBlock, [192, 1024, 3, True, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, MBR_HGBlock, [192, 1024, 3, True, True]]
  - [-1, 6, MBR_HGBlock, [192, 1024, 3, True, True]]  # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P5/32
  - [-1, 6, MBR_HGBlock, [384, 2048, 3, True, False]]  # stage 4
  - [-1, 1, SPPF, [1024, 5]]  # 10
  - [-1, 2, C2PSA, [1024]] # 11

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4 # 13
  - [-1, 2, RSS_SS2D_Vmamba, [512, False]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3 # 16
  - [-1, 2, RSS_SS2D_Vmamba, [256, False]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # cat head P4 # 19
  - [-1, 2, RSS_SS2D_Vmamba, [512, False]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 21 
  - [[-1, 11], 1, Concat, [1]] # cat head P5 # 22
  - [-1, 2, RSS_SS2D_Vmamba, [1024, True]]  # 23 (P5/32-large)

  # - [[17, 20, 23], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
  - [[17, 20, 23], 1, Segment_SWF, [nc, 32, 256, 256]] # Segment(P3, P4, P5)